MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAB176/mcu.h
extern volatile __GLCDCLUT44bits_t GLCDCLUT44bits __asm__ ("GLCDCLUT44") __attribute__((section("sfrs"), address(0xBF8EA4B0)));
#define GLCDCLUT45 GLCDCLUT45
extern volatile uint32_t   GLCDCLUT45 __attribute__((section("sfrs"), address(0xBF8EA4B4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT45bits_t;
extern volatile __GLCDCLUT45bits_t GLCDCLUT45bits __asm__ ("GLCDCLUT45") __attribute__((section("sfrs"), address(0xBF8EA4B4)));
#define GLCDCLUT46 GLCDCLUT46
extern volatile uint32_t   GLCDCLUT46 __attribute__((section("sfrs"), address(0xBF8EA4B8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT46bits_t;
extern volatile __GLCDCLUT46bits_t GLCDCLUT46bits __asm__ ("GLCDCLUT46") __attribute__((section("sfrs"), address(0xBF8EA4B8)));
#define GLCDCLUT47 GLCDCLUT47
extern volatile uint32_t   GLCDCLUT47 __attribute__((section("sfrs"), address(0xBF8EA4BC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT47bits_t;
extern volatile __GLCDCLUT47bits_t GLCDCLUT47bits __asm__ ("GLCDCLUT47") __attribute__((section("sfrs"), address(0xBF8EA4BC)));
#define GLCDCLUT48 GLCDCLUT48
extern volatile uint32_t   GLCDCLUT48 __attribute__((section("sfrs"), address(0xBF8EA4C0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT48bits_t;
extern volatile __GLCDCLUT48bits_t GLCDCLUT48bits __asm__ ("GLCDCLUT48") __attribute__((section("sfrs"), address(0xBF8EA4C0)));
#define GLCDCLUT49 GLCDCLUT49
extern volatile uint32_t   GLCDCLUT49 __attribute__((section("sfrs"), address(0xBF8EA4C4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT49bits_t;
extern volatile __GLCDCLUT49bits_t GLCDCLUT49bits __asm__ ("GLCDCLUT49") __attribute__((section("sfrs"), address(0xBF8EA4C4)));
#define GLCDCLUT50 GLCDCLUT50
extern volatile uint32_t   GLCDCLUT50 __attribute__((section("sfrs"), address(0xBF8EA4C8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT50bits_t;
extern volatile __GLCDCLUT50bits_t GLCDCLUT50bits __asm__ ("GLCDCLUT50") __attribute__((section("sfrs"), address(0xBF8EA4C8)));
#define GLCDCLUT51 GLCDCLUT51
extern volatile uint32_t   GLCDCLUT51 __attribute__((section("sfrs"), address(0xBF8EA4CC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT51bits_t;
extern volatile __GLCDCLUT51bits_t GLCDCLUT51bits __asm__ ("GLCDCLUT51") __attribute__((section("sfrs"), address(0xBF8EA4CC)));
#define GLCDCLUT52 GLCDCLUT52
extern volatile uint32_t   GLCDCLUT52 __attribute__((section("sfrs"), address(0xBF8EA4D0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT52bits_t;
extern volatile __GLCDCLUT52bits_t GLCDCLUT52bits __asm__ ("GLCDCLUT52") __attribute__((section("sfrs"), address(0xBF8EA4D0)));
#define GLCDCLUT53 GLCDCLUT53
extern volatile uint32_t   GLCDCLUT53 __attribute__((section("sfrs"), address(0xBF8EA4D4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT53bits_t;
extern volatile __GLCDCLUT53bits_t GLCDCLUT53bits __asm__ ("GLCDCLUT53") __attribute__((section("sfrs"), address(0xBF8EA4D4)));
#define GLCDCLUT54 GLCDCLUT54
extern volatile uint32_t   GLCDCLUT54 __attribute__((section("sfrs"), address(0xBF8EA4D8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT54bits_t;
extern volatile __GLCDCLUT54bits_t GLCDCLUT54bits __asm__ ("GLCDCLUT54") __attribute__((section("sfrs"), address(0xBF8EA4D8)));
#define GLCDCLUT55 GLCDCLUT55
extern volatile uint32_t   GLCDCLUT55 __attribute__((section("sfrs"), address(0xBF8EA4DC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT55bits_t;
extern volatile __GLCDCLUT55bits_t GLCDCLUT55bits __asm__ ("GLCDCLUT55") __attribute__((section("sfrs"), address(0xBF8EA4DC)));
#define GLCDCLUT56 GLCDCLUT56
extern volatile uint32_t   GLCDCLUT56 __attribute__((section("sfrs"), address(0xBF8EA4E0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT56bits_t;
extern volatile __GLCDCLUT56bits_t GLCDCLUT56bits __asm__ ("GLCDCLUT56") __attribute__((section("sfrs"), address(0xBF8EA4E0)));
#define GLCDCLUT57 GLCDCLUT57
extern volatile uint32_t   GLCDCLUT57 __attribute__((section("sfrs"), address(0xBF8EA4E4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT57bits_t;
extern volatile __GLCDCLUT57bits_t GLCDCLUT57bits __asm__ ("GLCDCLUT57") __attribute__((section("sfrs"), address(0xBF8EA4E4)));
#define GLCDCLUT58 GLCDCLUT58
extern volatile uint32_t   GLCDCLUT58 __attribute__((section("sfrs"), address(0xBF8EA4E8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT58bits_t;
extern volatile __GLCDCLUT58bits_t GLCDCLUT58bits __asm__ ("GLCDCLUT58") __attribute__((section("sfrs"), address(0xBF8EA4E8)));
#define GLCDCLUT59 GLCDCLUT59
extern volatile uint32_t   GLCDCLUT59 __attribute__((section("sfrs"), address(0xBF8EA4EC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT59bits_t;
extern volatile __GLCDCLUT59bits_t GLCDCLUT59bits __asm__ ("GLCDCLUT59") __attribute__((section("sfrs"), address(0xBF8EA4EC)));
#define GLCDCLUT60 GLCDCLUT60
extern volatile uint32_t   GLCDCLUT60 __attribute__((section("sfrs"), address(0xBF8EA4F0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT60bits_t;
extern volatile __GLCDCLUT60bits_t GLCDCLUT60bits __asm__ ("GLCDCLUT60") __attribute__((section("sfrs"), address(0xBF8EA4F0)));
#define GLCDCLUT61 GLCDCLUT61
extern volatile uint32_t   GLCDCLUT61 __attribute__((section("sfrs"), address(0xBF8EA4F4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT61bits_t;
extern volatile __GLCDCLUT61bits_t GLCDCLUT61bits __asm__ ("GLCDCLUT61") __attribute__((section("sfrs"), address(0xBF8EA4F4)));
#define GLCDCLUT62 GLCDCLUT62
extern volatile uint32_t   GLCDCLUT62 __attribute__((section("sfrs"), address(0xBF8EA4F8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT62bits_t;
