MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAB176/mcu.h
#define _GLCDCURDATA22_PIXEL521_POSITION         0x00000008
#define _GLCDCURDATA22_PIXEL521_MASK             0x00000F00
#define _GLCDCURDATA22_PIXEL521_LENGTH           0x00000004

#define _GLCDCURDATA22_PIXEL520_POSITION         0x0000000C
#define _GLCDCURDATA22_PIXEL520_MASK             0x0000F000
#define _GLCDCURDATA22_PIXEL520_LENGTH           0x00000004

#define _GLCDCURDATA22_PIXEL519_POSITION         0x00000010
#define _GLCDCURDATA22_PIXEL519_MASK             0x000F0000
#define _GLCDCURDATA22_PIXEL519_LENGTH           0x00000004

#define _GLCDCURDATA22_PIXEL518_POSITION         0x00000014
#define _GLCDCURDATA22_PIXEL518_MASK             0x00F00000
#define _GLCDCURDATA22_PIXEL518_LENGTH           0x00000004

#define _GLCDCURDATA22_PIXEL517_POSITION         0x00000018
#define _GLCDCURDATA22_PIXEL517_MASK             0x0F000000
#define _GLCDCURDATA22_PIXEL517_LENGTH           0x00000004

#define _GLCDCURDATA22_PIXEL516_POSITION         0x0000001C
#define _GLCDCURDATA22_PIXEL516_MASK             0xF0000000
#define _GLCDCURDATA22_PIXEL516_LENGTH           0x00000004

#define _GLCDCURDATA23_PIXEL531_POSITION         0x00000000
#define _GLCDCURDATA23_PIXEL531_MASK             0x0000000F
#define _GLCDCURDATA23_PIXEL531_LENGTH           0x00000004

#define _GLCDCURDATA23_PIXEL530_POSITION         0x00000004
#define _GLCDCURDATA23_PIXEL530_MASK             0x000000F0
#define _GLCDCURDATA23_PIXEL530_LENGTH           0x00000004

#define _GLCDCURDATA23_PIXEL529_POSITION         0x00000008
#define _GLCDCURDATA23_PIXEL529_MASK             0x00000F00
#define _GLCDCURDATA23_PIXEL529_LENGTH           0x00000004

#define _GLCDCURDATA23_PIXEL528_POSITION         0x0000000C
#define _GLCDCURDATA23_PIXEL528_MASK             0x0000F000
#define _GLCDCURDATA23_PIXEL528_LENGTH           0x00000004

#define _GLCDCURDATA23_PIXEL527_POSITION         0x00000010
#define _GLCDCURDATA23_PIXEL527_MASK             0x000F0000
#define _GLCDCURDATA23_PIXEL527_LENGTH           0x00000004

#define _GLCDCURDATA23_PIXEL526_POSITION         0x00000014
#define _GLCDCURDATA23_PIXEL526_MASK             0x00F00000
#define _GLCDCURDATA23_PIXEL526_LENGTH           0x00000004

#define _GLCDCURDATA23_PIXEL525_POSITION         0x00000018
#define _GLCDCURDATA23_PIXEL525_MASK             0x0F000000
#define _GLCDCURDATA23_PIXEL525_LENGTH           0x00000004

#define _GLCDCURDATA23_PIXEL524_POSITION         0x0000001C
#define _GLCDCURDATA23_PIXEL524_MASK             0xF0000000
#define _GLCDCURDATA23_PIXEL524_LENGTH           0x00000004

#define _GLCDCURDATA24_PIXEL67_POSITION          0x00000000
#define _GLCDCURDATA24_PIXEL67_MASK              0x0000000F
#define _GLCDCURDATA24_PIXEL67_LENGTH            0x00000004

#define _GLCDCURDATA24_PIXEL66_POSITION          0x00000004
#define _GLCDCURDATA24_PIXEL66_MASK              0x000000F0
#define _GLCDCURDATA24_PIXEL66_LENGTH            0x00000004

#define _GLCDCURDATA24_PIXEL65_POSITION          0x00000008
#define _GLCDCURDATA24_PIXEL65_MASK              0x00000F00
#define _GLCDCURDATA24_PIXEL65_LENGTH            0x00000004

#define _GLCDCURDATA24_PIXEL64_POSITION          0x0000000C
#define _GLCDCURDATA24_PIXEL64_MASK              0x0000F000
#define _GLCDCURDATA24_PIXEL64_LENGTH            0x00000004

#define _GLCDCURDATA24_PIXEL63_POSITION          0x00000010
#define _GLCDCURDATA24_PIXEL63_MASK              0x000F0000
#define _GLCDCURDATA24_PIXEL63_LENGTH            0x00000004

#define _GLCDCURDATA24_PIXEL62_POSITION          0x00000014
#define _GLCDCURDATA24_PIXEL62_MASK              0x00F00000
#define _GLCDCURDATA24_PIXEL62_LENGTH            0x00000004

#define _GLCDCURDATA24_PIXEL61_POSITION          0x00000018
#define _GLCDCURDATA24_PIXEL61_MASK              0x0F000000
#define _GLCDCURDATA24_PIXEL61_LENGTH            0x00000004

#define _GLCDCURDATA24_PIXEL60_POSITION          0x0000001C
#define _GLCDCURDATA24_PIXEL60_MASK              0xF0000000
#define _GLCDCURDATA24_PIXEL60_LENGTH            0x00000004

#define _GLCDCURDATA25_PIXEL615_POSITION         0x00000000
#define _GLCDCURDATA25_PIXEL615_MASK             0x0000000F
#define _GLCDCURDATA25_PIXEL615_LENGTH           0x00000004

#define _GLCDCURDATA25_PIXEL614_POSITION         0x00000004
#define _GLCDCURDATA25_PIXEL614_MASK             0x000000F0
#define _GLCDCURDATA25_PIXEL614_LENGTH           0x00000004

#define _GLCDCURDATA25_PIXEL613_POSITION         0x00000008
#define _GLCDCURDATA25_PIXEL613_MASK             0x00000F00
#define _GLCDCURDATA25_PIXEL613_LENGTH           0x00000004

#define _GLCDCURDATA25_PIXEL612_POSITION         0x0000000C
#define _GLCDCURDATA25_PIXEL612_MASK             0x0000F000
#define _GLCDCURDATA25_PIXEL612_LENGTH           0x00000004

#define _GLCDCURDATA25_PIXEL611_POSITION         0x00000010
#define _GLCDCURDATA25_PIXEL611_MASK             0x000F0000
#define _GLCDCURDATA25_PIXEL611_LENGTH           0x00000004

#define _GLCDCURDATA25_PIXEL610_POSITION         0x00000014
#define _GLCDCURDATA25_PIXEL610_MASK             0x00F00000
#define _GLCDCURDATA25_PIXEL610_LENGTH           0x00000004

#define _GLCDCURDATA25_PIXEL69_POSITION          0x00000018
#define _GLCDCURDATA25_PIXEL69_MASK              0x0F000000
#define _GLCDCURDATA25_PIXEL69_LENGTH            0x00000004

#define _GLCDCURDATA25_PIXEL68_POSITION          0x0000001C
#define _GLCDCURDATA25_PIXEL68_MASK              0xF0000000
#define _GLCDCURDATA25_PIXEL68_LENGTH            0x00000004

#define _GLCDCURDATA26_PIXEL623_POSITION         0x00000000
#define _GLCDCURDATA26_PIXEL623_MASK             0x0000000F
#define _GLCDCURDATA26_PIXEL623_LENGTH           0x00000004

#define _GLCDCURDATA26_PIXEL622_POSITION         0x00000004
#define _GLCDCURDATA26_PIXEL622_MASK             0x000000F0
#define _GLCDCURDATA26_PIXEL622_LENGTH           0x00000004

#define _GLCDCURDATA26_PIXEL621_POSITION         0x00000008
#define _GLCDCURDATA26_PIXEL621_MASK             0x00000F00
#define _GLCDCURDATA26_PIXEL621_LENGTH           0x00000004

#define _GLCDCURDATA26_PIXEL620_POSITION         0x0000000C
#define _GLCDCURDATA26_PIXEL620_MASK             0x0000F000
#define _GLCDCURDATA26_PIXEL620_LENGTH           0x00000004

#define _GLCDCURDATA26_PIXEL619_POSITION         0x00000010
#define _GLCDCURDATA26_PIXEL619_MASK             0x000F0000
#define _GLCDCURDATA26_PIXEL619_LENGTH           0x00000004

