MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAB176/mcu.h
#define _GLCDCURDATA49_PIXEL1214_POSITION        0x00000004
#define _GLCDCURDATA49_PIXEL1214_MASK            0x000000F0
#define _GLCDCURDATA49_PIXEL1214_LENGTH          0x00000004

#define _GLCDCURDATA49_PIXEL1213_POSITION        0x00000008
#define _GLCDCURDATA49_PIXEL1213_MASK            0x00000F00
#define _GLCDCURDATA49_PIXEL1213_LENGTH          0x00000004

#define _GLCDCURDATA49_PIXEL1212_POSITION        0x0000000C
#define _GLCDCURDATA49_PIXEL1212_MASK            0x0000F000
#define _GLCDCURDATA49_PIXEL1212_LENGTH          0x00000004

#define _GLCDCURDATA49_PIXEL1211_POSITION        0x00000010
#define _GLCDCURDATA49_PIXEL1211_MASK            0x000F0000
#define _GLCDCURDATA49_PIXEL1211_LENGTH          0x00000004

#define _GLCDCURDATA49_PIXEL1210_POSITION        0x00000014
#define _GLCDCURDATA49_PIXEL1210_MASK            0x00F00000
#define _GLCDCURDATA49_PIXEL1210_LENGTH          0x00000004

#define _GLCDCURDATA49_PIXEL129_POSITION         0x00000018
#define _GLCDCURDATA49_PIXEL129_MASK             0x0F000000
#define _GLCDCURDATA49_PIXEL129_LENGTH           0x00000004

#define _GLCDCURDATA49_PIXEL128_POSITION         0x0000001C
#define _GLCDCURDATA49_PIXEL128_MASK             0xF0000000
#define _GLCDCURDATA49_PIXEL128_LENGTH           0x00000004

#define _GLCDCURDATA50_PIXEL1223_POSITION        0x00000000
#define _GLCDCURDATA50_PIXEL1223_MASK            0x0000000F
#define _GLCDCURDATA50_PIXEL1223_LENGTH          0x00000004

#define _GLCDCURDATA50_PIXEL1222_POSITION        0x00000004
#define _GLCDCURDATA50_PIXEL1222_MASK            0x000000F0
#define _GLCDCURDATA50_PIXEL1222_LENGTH          0x00000004

#define _GLCDCURDATA50_PIXEL1221_POSITION        0x00000008
#define _GLCDCURDATA50_PIXEL1221_MASK            0x00000F00
#define _GLCDCURDATA50_PIXEL1221_LENGTH          0x00000004

#define _GLCDCURDATA50_PIXEL1220_POSITION        0x0000000C
#define _GLCDCURDATA50_PIXEL1220_MASK            0x0000F000
#define _GLCDCURDATA50_PIXEL1220_LENGTH          0x00000004

#define _GLCDCURDATA50_PIXEL1219_POSITION        0x00000010
#define _GLCDCURDATA50_PIXEL1219_MASK            0x000F0000
#define _GLCDCURDATA50_PIXEL1219_LENGTH          0x00000004

#define _GLCDCURDATA50_PIXEL1218_POSITION        0x00000014
#define _GLCDCURDATA50_PIXEL1218_MASK            0x00F00000
#define _GLCDCURDATA50_PIXEL1218_LENGTH          0x00000004

#define _GLCDCURDATA50_PIXEL1217_POSITION        0x00000018
#define _GLCDCURDATA50_PIXEL1217_MASK            0x0F000000
#define _GLCDCURDATA50_PIXEL1217_LENGTH          0x00000004

#define _GLCDCURDATA50_PIXEL1216_POSITION        0x0000001C
#define _GLCDCURDATA50_PIXEL1216_MASK            0xF0000000
#define _GLCDCURDATA50_PIXEL1216_LENGTH          0x00000004

#define _GLCDCURDATA51_PIXEL1231_POSITION        0x00000000
#define _GLCDCURDATA51_PIXEL1231_MASK            0x0000000F
#define _GLCDCURDATA51_PIXEL1231_LENGTH          0x00000004

#define _GLCDCURDATA51_PIXEL1230_POSITION        0x00000004
#define _GLCDCURDATA51_PIXEL1230_MASK            0x000000F0
#define _GLCDCURDATA51_PIXEL1230_LENGTH          0x00000004

#define _GLCDCURDATA51_PIXEL1229_POSITION        0x00000008
#define _GLCDCURDATA51_PIXEL1229_MASK            0x00000F00
#define _GLCDCURDATA51_PIXEL1229_LENGTH          0x00000004

#define _GLCDCURDATA51_PIXEL1228_POSITION        0x0000000C
#define _GLCDCURDATA51_PIXEL1228_MASK            0x0000F000
#define _GLCDCURDATA51_PIXEL1228_LENGTH          0x00000004

#define _GLCDCURDATA51_PIXEL1227_POSITION        0x00000010
#define _GLCDCURDATA51_PIXEL1227_MASK            0x000F0000
#define _GLCDCURDATA51_PIXEL1227_LENGTH          0x00000004

#define _GLCDCURDATA51_PIXEL1226_POSITION        0x00000014
#define _GLCDCURDATA51_PIXEL1226_MASK            0x00F00000
#define _GLCDCURDATA51_PIXEL1226_LENGTH          0x00000004

#define _GLCDCURDATA51_PIXEL1225_POSITION        0x00000018
#define _GLCDCURDATA51_PIXEL1225_MASK            0x0F000000
#define _GLCDCURDATA51_PIXEL1225_LENGTH          0x00000004

#define _GLCDCURDATA51_PIXEL1224_POSITION        0x0000001C
#define _GLCDCURDATA51_PIXEL1224_MASK            0xF0000000
#define _GLCDCURDATA51_PIXEL1224_LENGTH          0x00000004

#define _GLCDCURDATA52_PIXEL137_POSITION         0x00000000
#define _GLCDCURDATA52_PIXEL137_MASK             0x0000000F
#define _GLCDCURDATA52_PIXEL137_LENGTH           0x00000004

#define _GLCDCURDATA52_PIXEL136_POSITION         0x00000004
#define _GLCDCURDATA52_PIXEL136_MASK             0x000000F0
#define _GLCDCURDATA52_PIXEL136_LENGTH           0x00000004

#define _GLCDCURDATA52_PIXEL135_POSITION         0x00000008
#define _GLCDCURDATA52_PIXEL135_MASK             0x00000F00
#define _GLCDCURDATA52_PIXEL135_LENGTH           0x00000004

#define _GLCDCURDATA52_PIXEL134_POSITION         0x0000000C
#define _GLCDCURDATA52_PIXEL134_MASK             0x0000F000
#define _GLCDCURDATA52_PIXEL134_LENGTH           0x00000004

#define _GLCDCURDATA52_PIXEL133_POSITION         0x00000010
#define _GLCDCURDATA52_PIXEL133_MASK             0x000F0000
#define _GLCDCURDATA52_PIXEL133_LENGTH           0x00000004

#define _GLCDCURDATA52_PIXEL132_POSITION         0x00000014
#define _GLCDCURDATA52_PIXEL132_MASK             0x00F00000
#define _GLCDCURDATA52_PIXEL132_LENGTH           0x00000004

#define _GLCDCURDATA52_PIXEL131_POSITION         0x00000018
#define _GLCDCURDATA52_PIXEL131_MASK             0x0F000000
#define _GLCDCURDATA52_PIXEL131_LENGTH           0x00000004

#define _GLCDCURDATA52_PIXEL130_POSITION         0x0000001C
#define _GLCDCURDATA52_PIXEL130_MASK             0xF0000000
#define _GLCDCURDATA52_PIXEL130_LENGTH           0x00000004

#define _GLCDCURDATA53_PIXEL1315_POSITION        0x00000000
#define _GLCDCURDATA53_PIXEL1315_MASK            0x0000000F
#define _GLCDCURDATA53_PIXEL1315_LENGTH          0x00000004

#define _GLCDCURDATA53_PIXEL1314_POSITION        0x00000004
#define _GLCDCURDATA53_PIXEL1314_MASK            0x000000F0
#define _GLCDCURDATA53_PIXEL1314_LENGTH          0x00000004

#define _GLCDCURDATA53_PIXEL1313_POSITION        0x00000008
#define _GLCDCURDATA53_PIXEL1313_MASK            0x00000F00
#define _GLCDCURDATA53_PIXEL1313_LENGTH          0x00000004

#define _GLCDCURDATA53_PIXEL1312_POSITION        0x0000000C
#define _GLCDCURDATA53_PIXEL1312_MASK            0x0000F000
#define _GLCDCURDATA53_PIXEL1312_LENGTH          0x00000004

#define _GLCDCURDATA53_PIXEL1311_POSITION        0x00000010
#define _GLCDCURDATA53_PIXEL1311_MASK            0x000F0000
#define _GLCDCURDATA53_PIXEL1311_LENGTH          0x00000004

#define _GLCDCURDATA53_PIXEL1310_POSITION        0x00000014
#define _GLCDCURDATA53_PIXEL1310_MASK            0x00F00000
#define _GLCDCURDATA53_PIXEL1310_LENGTH          0x00000004

#define _GLCDCURDATA53_PIXEL139_POSITION         0x00000018
#define _GLCDCURDATA53_PIXEL139_MASK             0x0F000000
#define _GLCDCURDATA53_PIXEL139_LENGTH           0x00000004

#define _GLCDCURDATA53_PIXEL138_POSITION         0x0000001C
#define _GLCDCURDATA53_PIXEL138_MASK             0xF0000000
#define _GLCDCURDATA53_PIXEL138_LENGTH           0x00000004

